controllers/BpjsController.php

    public function actionEmployee(){
        $model = new BpjsEmployee();
        if($model->validate() && $model->load(Yii::$app->request->queryParams) && isset($_GET['search']))
---
SELECT * FROM `bpjs_employee` WHERE `employee_id`=10406