controllers/SiteController.php

SELECT * FROM `helpdesk` WHERE `employee_id`=844
---
    public function actionLogin(){

	$model = new Employee(['scenario'=>'login']);
        if ($model->load(Yii::$app->request->post()) && $model->validate() && $model->getLogin()) {
	    $helpdesk = new \app\models\Helpdesk();
	    $helpdesk = $helpdesk->find()
	    ->where(['employee_id'=>Yii::$app->user->getId()])
	    ->one();