controllers/TicketController.php

        }

        //change unread to read in ticket log
        TicketLog::updateAll(['ticket_read' => 0],['to_employee_id'=>Yii::$app->user->getId(),'ticket_id'=>$id]);
---
UPDATE `ticket_log` SET `ticket_read`=0 WHERE (`to_employee_id`=10406) AND (`ticket_id`='38')

    public function actionOpen($id){
        if(!Yii::$app->session->get('helpdesk')) return $this->redirect(['ticket/view','id'=>$id]);
        if(!Ticket::getCheckId($id)) return $this->redirect(['ticket/myjob']);
        $model = new TicketLog();
        $query = Ticket::find()
        ->select(['*'])
        ->join('inner join','employee','employee.employee_id=ticket.employee_id')
        ->where(['ticket.ticket_id'=>$id])
        ->one();
        $queryAtt = new \app\models\TicketAttachment();
        $logQuery = $model->getTicketLogData($id);

        //change unread to read in ticket log
        TicketLog::updateAll(['ticket_read' => 0],['to_employee_id'=>Yii::$app->user->getId(),'ticket_id'=>$id]);
---
UPDATE `ticket_log` SET `ticket_read`=0 WHERE (`to_employee_id`=10790) AND (`ticket_id`='33')