controllers/TicketController.php

    public function actionView($id){
        //if(Yii::$app->session->get('helpdesk')) return $this->redirect(['ticket/open','id'=>$id]);
        if(!Ticket::getCheckId($id)) return $this->redirect(['ticket/index']);
        $model = new TicketLog();
        $query = Ticket::findOne($id);
        $logQuery = $model->getTicketLogData($id);
        if($model->load(Yii::$app->request->post()) && $model->getSave($id)){
---
SELECT * FROM `ticket_log` WHERE `log_id` IS NULL