controllers/TicketController.php

    public function actionIndex() {
        $model = new Ticket(['scenario'=>'search']);
        if($model->validate() && $model->load(Yii::$app->request->queryParams)) {
---
SELECT * FROM `ticket` WHERE `ticket_id`='38'

    public function actionNew() {
        $model = new Ticket(['scenario' => 'new_ticket']);
        if($model->load(Yii::$app->request->post()) && $model->getSave()) {
            Yii::$app->session->setFlash('message','<div class="alert alert-success"> <i class="fa fa-check"></i> '. Yii::t('app/message','msg ticket has been insert').'</div>');
            $this->redirect(['ticket/index'],301);
        } else {
        	TicketAttachment::deleteAll('ticket_id = :id and ticket_md5 = :md5 ',[':id' => 0 , ':md5' => md5(Yii::$app->user->getId()) ]);
---
DELETE FROM `ticket_attachment` WHERE ticket_id = 0 and ticket_md5 = '4e77c1b05bf7e361197a5adb20faa212'

    public function actionView($id) {
        $model = new TicketLog();
        $query = Ticket::findOne($id);
        $logQuery = $model->getTicketLogData($id);
        if($model->load(Yii::$app->request->post()) && $model->getSave($id)) {
        	$status_id = $query->id;
        	if($status_id == 0)
        		$redirect = Yii::$app->request->hostInfo.\yii\helpers\Url::to(['ticket/index']);
        	else
        		$redirect = '';
        	Yii::$app->response->format = 'json';
            return [
            	'success' => true,
            	'comment' => $model->log_desc,
            	'date' => date('d/m/Y H:i:s'),
            	'employee'=>Yii::$app->user->identity->EmployeeFirstName,'redirect' => $redirect
            ];
        }

        //change unread to read in ticket log
        TicketLog::updateAll(['ticket_read' => 0],['to_employee_id'=>Yii::$app->user->getId(),'ticket_id'=>$id]);
        $model->ticket_rating = 3;
        return $this->render('ticket_view',[
            'model' => $model,
            'query' => $query,
        	'attacthment' => TicketAttachment::find()->where(["ticket_id" => $id])->all(),
            'logQuery' => $logQuery
        ]);
---
SELECT * FROM `ticket` WHERE `ticket_id`='34'
UPDATE `ticket_log` SET `ticket_read`=0 WHERE (`to_employee_id`=10406) AND (`ticket_id`='34')
SELECT * FROM `ticket` inner join `employee` ON employee.employee_id=ticket.employee_id WHERE `ticket`.`ticket_id`='38'
SELECT * FROM `ticket_attachment` WHERE `ticket_id`='34'

    public function actionOpen($id) {
        $model = new TicketLog();
        //change unread to read in ticket log
        $model->updateAll(['ticket_read' => 0],['to_employee_id'=>Yii::$app->user->getId(),'ticket_id'=>$id]);
        if($model->load(Yii::$app->request->post()) && $model->getSave($id,true)) {
            Yii::$app->response->format = 'json';
            return ['success' => true,'comment' => $model->log_desc,'date' => date('d/m/Y H:i:s'),'employee'=>Yii::$app->user->identity->EmployeeFirstName];
        }

        return $this->render('ticket_open',[
            'model' => $model,
            'attachtment' => TicketAttachment::find()->where(['ticket_id'=>$id])->all(),
            'val' => Ticket::find()->join('inner join','employee','employee.employee_id=ticket.employee_id')
        				->where(['ticket.ticket_id' => $id])->one(),
---
SELECT * FROM `ticket_attachment` WHERE `ticket_id`='33'
SELECT `ticket`.* FROM `ticket` inner join `employee` ON employee.employee_id=ticket.employee_id WHERE `ticket`.`ticket_id`='33'

    public function actionClosed($id) {
    	$ticket = Ticket::findOne(["ticket_id" => $id]);
    	if($ticket->ticket_status == 0) {
    		Ticket::updateAll(['ticket_status_helpdesk' => 0], ['ticket_id' => $id]);
---
SELECT * FROM `ticket` WHERE `ticket_id`='33'
UPDATE `ticket` SET `ticket_status_helpdesk`=0 WHERE `ticket_id`='33'