models/Employee.php

    public static function findIdentity($id){
        return static::findOne(['employee_id' => $id]);
---
SELECT * FROM `employee` WHERE `employee_id`=10790