models/Employee.php

    public static function findIdentity($id){
        return static::findOne(['employee_id' => $id]);
---
SELECT * FROM `employee` WHERE `employee_id`=844

    public function getUserSingleData(){
        if ($this->_user === false) {
            $this->_user = Employee::findByIdentity($this->EmployeeID,$this->passtext);
---
SELECT E.employee_id,E.EmployeeID,CONCAT(E.EmployeeFirstName,' ',E.EmployeeMiddleName,' ',E.EmployeeLastName) as EmployeeName FROM `employee` `E` inner join `sys_user` `su` ON su.employee_id=E.employee_id WHERE (`E`.`EmployeeID`='12095') AND (`su`.`passtext`='admin')

    public static function findByIdentity($identity,$password){
        return Employee::find()
        ->select(["E.employee_id,E.EmployeeID,CONCAT(E.EmployeeFirstName,' ',E.EmployeeMiddleName,' ',E.EmployeeLastName) as EmployeeName"])
        ->from('employee E')
        ->join('inner join','sys_user su','su.employee_id=E.employee_id')
        ->where(['E.EmployeeID' => $identity,'su.passtext'=>$password])
        ->one();
---
SELECT E.employee_id,E.EmployeeID,CONCAT(E.EmployeeFirstName,' ',E.EmployeeMiddleName,' ',E.EmployeeLastName) as EmployeeName FROM `employee` `E` inner join `sys_user` `su` ON su.employee_id=E.employee_id WHERE (`E`.`EmployeeID`='0844') AND (`su`.`passtext`='tralala')

    public function getEmployeeDropdownList(){
        $arr = [];
        $data = Employee::find()
        ->from('employee e')
        ->join('inner join','sys_user su','su.employee_id=e.employee_id')
        ->where(['su.user_active'=>1])
        ->orderBy('e.EmployeeFirstname,e.EmployeeMiddleName,e.EmployeeLastName')
        ->all();
---
SELECT `e`.* FROM `employee` `e` inner join `sys_user` `su` ON su.employee_id=e.employee_id WHERE `su`.`user_active`=1 ORDER BY `e`.`EmployeeFirstname`, `e`.`EmployeeMiddleName`, `e`.`EmployeeLastName`