models/Helpdesk.php

SELECT * FROM `helpdesk` WHERE `employee_id`=10790
---
    public function findByID($employee_id){
	return Helpdesk::find()
        ->where(['employee_id' => $employee_id])
	->one();

SELECT *, IF(role_id=1,'Leader','Staff') as role FROM `helpdesk` `h` inner join `employee` `e` ON e.employee_id = h.employee_id
---
    public static function getDropdownListData($all=true){
	$query = Helpdesk::find()
        ->select(['*',"IF(role_id=1,'Leader','Staff') as role"])
        ->from('helpdesk h')
        ->join('inner join','employee e','e.employee_id = h.employee_id')
	->all();