models/Report.php

    public static function getHelpdeskList(){
        $query = \app\models\Helpdesk::find()
        ->select(["*","CONCAT(e.EmployeeFirstName,' ',e.EmployeeMiddleName,' ',e.EmployeeLastName) as employee_name"])
        ->from('helpdesk h')
        ->join('inner join','employee e','e.employee_id = h.employee_id')
        ->where(['NOT IN', 'role_id', [1]])
        ->orderBy('e.EmployeeFirstName')
	->all();
---
SELECT *, CONCAT(e.EmployeeFirstName,' ',e.EmployeeMiddleName,' ',e.EmployeeLastName) as employee_name FROM `helpdesk` `h` inner join `employee` `e` ON e.employee_id = h.employee_id WHERE `role_id`<>1 ORDER BY `e`.`EmployeeFirstName`