models/Ticket.php

    public function getAllDataProvider($params,$employee_id = null,$status = null,$helpdesk = null){
        $sql = "SELECT ticket_id,DATE_FORMAT(ticket_date,'%d/%m/%Y') as ticket_date,ticket_subject,
	        	CONCAT(hh.EmployeeFirstName,' ',hh.EmployeeMiddleName,' ',hh.EmployeeLastName) as helpdesk_name,ticket_usercomment,
	        	CONCAT(e.EmployeeFirstName,' ',e.EmployeeMiddleName,' ',e.EmployeeLastName) as employee_name,ticket_status,
	        	CASE
	            	WHEN ticket_status = 4 THEN '".Yii::t("app","new")."'
	            	WHEN ticket_status = 3 THEN '".Yii::t("app","open")."'
	            	WHEN ticket_status = 2 THEN '".Yii::t("app","progress")."'
	            	WHEN ticket_status = 1 THEN '".Yii::t("app","finish")."'
	            	WHEN ticket_status = 0 AND ticket_status_helpdesk = 1 THEN '".Yii::t("app","closed")." (50%) '
	            	WHEN ticket_status = 0 AND ticket_status_helpdesk = 0 THEN '".Yii::t("app","closed")." (100%) '
		        END ticket_status_string,ticket_helpdesk
		        FROM ticket t
		        LEFT JOIN helpdesk h on h.employee_id = t.ticket_helpdesk
		        LEFT JOIN employee hh on hh.employee_id = h.employee_id
		        INNER JOIN employee e on e.employee_id = t.employee_id
		        WHERE e.employee_id > 0 ";

        if($employee_id) $sql.= " AND t.employee_id=".$employee_id;
        if($status) $sql.= " AND ticket_status=".$status;
        if($helpdesk) $sql.= " AND ticket_helpdesk=".$helpdesk;

        if ($this->load($params) && $this->ticket_status != "")
---
SELECT * FROM `ticket` inner join `employee` ON employee.employee_id=ticket.employee_id WHERE `ticket_status`=4

    public static function getHelpdeskNewTicketData($status){
        $ticket = new Ticket();
        $query = $ticket->find()
        ->select(['*'])
        ->join('inner join','employee','employee.employee_id=ticket.employee_id')
        ->where(['ticket_status'=>$status])
        ->all();
---
SELECT * FROM `ticket` inner join `employee` ON employee.employee_id=ticket.employee_id WHERE `ticket_status`=4

    public static function getHelpdeskTicketData($status){
        $ticket = new Ticket();
        $query = $ticket->find()
        ->select(['*'])
        ->join('inner join','employee','employee.employee_id=ticket.employee_id')
        ->where(['ticket_status'=>$status,'ticket_helpdesk'=>Yii::$app->user->getId()])
        ->all();
---
SELECT * FROM `ticket` inner join `employee` ON employee.employee_id=ticket.employee_id WHERE (`ticket_status`=3) AND (`ticket_helpdesk` IS NULL)