models/TicketLog.php

    public function attributeLabels(){
        return [
	   'log_status' => Yii::$app->session->get('helpdesk')?Yii::t('app','closed'):Yii::t('app','finish'),
           'ticket_rating' => Yii::t('app','rating'),
        ];
---
SELECT * FROM `ticket` WHERE `ticket_id`='38'

    public function getSave($id,$helpdesk=false){
        if($this->validate()){

            //find employee_id or ticket_helpdesk
            $user  = Ticket::findOne($id);
            if(!Yii::$app->session->get('helpdesk')){
                $user_id = $user->ticket_helpdesk;
                $closed_status = 0;
            }
            else{
                $user_id = $user->employee_id;
                $closed_status = 0;
            }


            $model = new TicketLog();
            $model->ticket_id = $id;
            $model->employee_id = Yii::$app->user->identity->getId();
            $model->to_employee_id = $user_id;
            $model->log_date = date('Y-m-d H:i:s');
            $model->log_desc = $this->log_desc;
            $model->ticket_read = 1;
            $model->insert();

            /*if($helpdesk==true){
                $ticket = new Ticket();
                $ticket = $ticket->findOne($id);
---
INSERT INTO `ticket_log` (`ticket_id`, `employee_id`, `to_employee_id`, `log_date`, `log_desc`, `ticket_read`) VALUES (38, 844, 844, '2014-12-24 08:10:02', 'oke siap gan', 1)
SELECT * FROM `ticket` WHERE `ticket_id`='38'

    public function getTicketLogData($id){
        return TicketLog::find()
        ->select(['*',"DATE_FORMAT(log_date,'%d/%m/%Y %H:%m:%s') as log_date","DATE_FORMAT(log_date,'%Y/%m/%d %H:%m:%s') as log_odate"])
        ->from('ticket_log')
        ->join('left join','employee','employee.employee_id=ticket_log.employee_id')
        ->where(['ticket_id'=>$id])
        ->orderBy('log_date DESC')
        ->all();
---
SELECT *, DATE_FORMAT(log_date,'%d/%m/%Y %H:%m:%s') as log_date, DATE_FORMAT(log_date,'%Y/%m/%d %H:%m:%s') as log_odate FROM `ticket_log` left join `employee` ON employee.employee_id=ticket_log.employee_id WHERE `ticket_id`='00000000039' ORDER BY `log_date`

    public static function getNewTicketLogData($limit=0){
        $query = TicketLog::find()
        ->select(['*'])
        ->from('ticket_log tl')
        ->join('inner join','ticket t','t.ticket_id=tl.ticket_id')
        ->join('inner join','employee e','e.employee_id=tl.employee_id')
        ->where(['ticket_read'=>1,'to_employee_id'=>Yii::$app->user->getId()])
        ->orderBy('tl.log_date')
        ->all();
---
SELECT * FROM `ticket_log` `tl` inner join `ticket` `t` ON t.ticket_id=tl.ticket_id inner join `employee` `e` ON e.employee_id=tl.employee_id WHERE (`ticket_read`=1) AND (`to_employee_id`=844) ORDER BY `tl`.`log_date`