models/TicketLog.php

SELECT * FROM `ticket_log` `tl` inner join `ticket` `t` ON t.ticket_id=tl.ticket_id inner join `employee` `e` ON e.employee_id=tl.employee_id WHERE (`ticket_read`=1) AND (`to_employee_id` IS NULL) ORDER BY `tl`.`log_date`
---
    public static function getNewTicketLogData($limit=0){
        $query = TicketLog::find()
        ->select(['*'])
        ->from('ticket_log tl')
        ->join('inner join','ticket t','t.ticket_id=tl.ticket_id')
        ->join('inner join','employee e','e.employee_id=tl.employee_id')
        ->where(['ticket_read'=>1,'to_employee_id'=>Yii::$app->user->getId()])
        ->orderBy('tl.log_date')
        ->all();