models/TicketCategory.php

SELECT * FROM `ticket_categories`
---
	public static function lists($label,$value) {
		$lists = array();
		$query = self::find()->all();